wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
// No more ifdefs

// List of devices:
// #define ESP1 // Test Arbeitszimmer
// #define ESP2 // Kueche
// #define ESP3 // Wohnzimmer
// #define ESP4 // Garten
// #define ESP6 // Test mit Lithium-Akku
// #define ESP7  // Hausanschlussraum
// #define ESP8 // Fernsehzimmer
// #define ESP9 // Heizraum
// #define ESP10 // Flur 1.OG
// #define ESP11 // Lolin32 Lite
// #define ESP12 // Schlafzimmer
// #define ESP13 // Lichterkette / Uhr
// #define ESP14 // Display
// #define ESP15 // Keller
// #define ESP16 // Flur EG
// #define ESP17 // DECIX Office
// #define ESP18 // Flur 2.OG
// #define ESP19 // Loggia
// #define ESP31 // Test
// #define ESP30 // DingDong

const char compile_date[] = __DATE__ " " __TIME__;

#include <Arduino.h>
#include <ArduinoLog.h>


#if defined(ARDUINO_ARCH_ESP8266)
#include <ESP8266WiFi.h>
#include <AddrList.h>
#include <FS.h>
#define I2CSDA 4  //D2 gruen
#define I2CSCL 5  //D1 gelb
ADC_MODE(ADC_VCC);

#elif defined (ARDUINO_ARCH_ESP32)
#include <WiFi.h>
#include <SPIFFS.h>

#if defined(ESP32_CAMERA)
#include "esp_camera.h"
#include <WiFiClientSecure.h>
#endif

#if defined(BOARD_TTGO)
#define PWDN_GPIO_NUM       -1
#define RESET_GPIO_NUM      -1
#define XCLK_GPIO_NUM       32
#define SIOD_GPIO_NUM       13
#define SIOC_GPIO_NUM       12

#define Y9_GPIO_NUM         39
#define Y8_GPIO_NUM         36
#define Y7_GPIO_NUM         23
#define Y6_GPIO_NUM         18
#define Y5_GPIO_NUM         15
#define Y4_GPIO_NUM         4
#define Y3_GPIO_NUM         14
#define Y2_GPIO_NUM         5

#define VSYNC_GPIO_NUM      27
#define HREF_GPIO_NUM       25
#define PCLK_GPIO_NUM       19
#endif

#include "esp_bt.h"
#include "esp_bt_main.h"
#include "esp_bt_device.h"
#include "esp_gap_bt_api.h"
typedef enum {
    APP_GAP_STATE_IDLE = 0,
    APP_GAP_STATE_DEVICE_DISCOVERING,
    APP_GAP_STATE_DEVICE_DISCOVER_COMPLETE,
    APP_GAP_STATE_SERVICE_DISCOVERING,
    APP_GAP_STATE_SERVICE_DISCOVER_COMPLETE,
} app_gap_state_t;

typedef struct {
    bool dev_found;
    uint8_t bdname_len;
    uint8_t eir_len;
    uint8_t rssi;
    uint32_t cod;
    uint8_t eir[ESP_BT_GAP_EIR_DATA_LEN];
    uint8_t bdname[ESP_BT_GAP_MAX_BDNAME_LEN + 1];
    esp_bd_addr_t bda;
    app_gap_state_t state;
} app_gap_cb_t;

static app_gap_cb_t m_dev_info;

#else

#pragma message ("unknow build enviroment")
#error
#endif

// Board dependencies
#if defined(BOARD_HELTEC)
#define I2CSDA 4  //D2 gruen
#define I2CSCL 15  //D1 gelb
#endif

#include <PubSubClient.h>
#include <ArduinoJson.h>

// #define BME680Bosch true

// Sensor Libraries
#include <Wire.h>
#include "Adafruit_Si7021.h"
#include "Adafruit_BME280.h"
#if defined(BME680Bosch)
#include "bsec.h"
const uint8_t bsec_config_iaq[] = {
#include "config/generic_33v_3s_28d/bsec_iaq.txt"
};

#else
#include "Adafruit_BME680.h"
#endif
#include "Adafruit_TSL2561_U.h"
#include <Adafruit_NeoPixel.h>
#include "Adafruit_VEML6070.h"
#include "Adafruit_ADS1015.h"
#include "Adafruit_VL53L0X.h"
#include "Adafruit_TCS34725.h"
#include "Adafruit_CCS811.h"
#include <U8x8lib.h>
#include <SparkFun_AS3935.h>
#include <Max44009.h>

// Global defines
#define NEOPIXEL 14 //D5

#define AS3935_ADDR 0x03

// Global Objects
uint8_t nrofleds = 1;
neoPixelType ledtype = NEO_GRB + NEO_KHZ800;
bool has_white = false;

Adafruit_Si7021 si7021;
Adafruit_BME280 bme280;
#if defined(BME680Bosch)
Bsec iaqSensor;
void checkIaqSensorStatus(void);
#else
Adafruit_BME680 bme680;
#endif
Adafruit_CCS811 ccs;
Adafruit_TSL2561_Unified tsl2561 = Adafruit_TSL2561_Unified(TSL2561_ADDR_FLOAT);
Adafruit_VEML6070 veml = Adafruit_VEML6070();
Adafruit_VL53L0X lox = Adafruit_VL53L0X();
Adafruit_ADS1115 ads1115;
SparkFun_AS3935 as3935(AS3935_ADDR);
Adafruit_NeoPixel led = Adafruit_NeoPixel(nrofleds, NEOPIXEL, ledtype);
Adafruit_TCS34725 tcs = Adafruit_TCS34725();
Max44009 gy49(0x4a);
WiFiClient espClient;
PubSubClient client;
U8X8_SH1106_128X64_NONAME_HW_I2C u8x8(/* reset=*/ U8X8_PIN_NONE);
int pirState = LOW;
uint8_t pirInput = 12;
uint8_t as3935_input = 13; // D7 hardware int pin for AS3935
uint8_t as3935_tunecap = 96;
bool as3935_inconfig = false;


unsigned transmission_delay = 60; // seconds
uint32_t led_current_color;

// Strings for dynamic config
String Smyname, Spass, Sssid, Smqttserver, Ssite, Sroom, Smqttuser, Smqttpass;
unsigned int Imqttport;
bool Bflipped;
bool Bindoor = true;
bool Bco2alert = false; // CO2-Ampel


// Flags for sensors found
bool si7021_found = false;
bool bme280_found = false;
bool bme680_found = false;
bool tsl2561_found= false;
bool voltage_found= true;
bool ccs811_found = false;
bool u8x8_found = false;
bool veml_found = false;
bool lox_found = false;
bool tcs_found = false;
bool ads1115_found = false;
bool rtc_init_done = false;
bool rtc_alarm_raised = false;
bool light_on = true;
bool pir_found = true;
bool as3935_found = false;
bool gy49_found = false;
bool camera_found = false;

bool color_watch = false;

// Floats for calibration
float bme280TempAdjust = 0.0;
float bme680TempAdjust = 0.0;
float si7021TempAdjust = 0.0;

// Flags for display
#define DISPLAY_OFF 0
#define DISPLAY_TEMPERATURE 1
#define DISPLAY_HUMIDITY 2
#define DISPLAY_AIRPRESSURE 3
#define DISPLAY_LUX 4
#define DISPLAY_STRING 5
#define DISPLAY_DISTANCE 6
#define DISPLAY_TEMPHUM 7
#define DISPLAY_CO2 8


unsigned int display_what = DISPLAY_TEMPHUM;
unsigned int display_brightness = 1;
bool display_refresh = true;

// Timer variables
unsigned long now;
unsigned long last_transmission = 0;
unsigned long last_display = 0;

// forward declarations
boolean setup_wifi();
void loop_publish_tcs34725();
void publish_status();
void publish_as3935();
void publish_bme280();
void publish_bme680();
void publish_si7021();
void publish_camera();


// LED routines
void setled(byte r, byte g, byte b) {
  if (has_white && r==g && r==b) {
    if (r<255)
      led.setPixelColor(0, 0, 0, 0, r);
    else
      led.setPixelColor(0, 255, 255, 255, 255);
  } else {
    led.setPixelColor(0, r, g, b);
  }
  led_current_color = led.Color(r,g,b);
  if (light_on) {
    led.show();
  }
}

void setled(byte n, byte r, byte g, byte b) {
  if (has_white && r==g && r==b) {
    if (r < 255)
      led.setPixelColor(n, 0, 0, 0, r);
    else
      led.setPixelColor(n, 255, 255, 255, 255);
  } else {
    led.setPixelColor(n, r, g, b);
  }
  if (n == 0)
    led_current_color = led.Color(r,g,b);
  if (light_on) {
    led.show();
  }
}

