wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
void setled(byte n, byte r, byte g, byte b, byte show) {
  led.setPixelColor(n, r, g, b);
  if (light_on && show) {
    led.show();
  }
}

void setled(byte show) {
  if (!show) {
    int i;
    for (i = 0; i < nrofleds; i++) {
      setled(i, 0, 0, 0, 0);
    }
  }
  led.show();
}

// Debug functions
void log_config () {

  Log.verbose("Smyname = %s",Smyname.c_str());
  Log.verbose("Ssite = %s",Ssite.c_str());
  Log.verbose("Sroom = %s",Sroom.c_str());
  Log.verbose("Sssid = %s",Sssid.c_str());
  Log.verbose("Spass = %s",Spass.c_str());
  Log.verbose("Smqttuser = %s",Smqttuser.c_str());
  Log.verbose("Smqttpass = %s",Smqttpass.c_str());
  Log.verbose("Imqttport = %d",Imqttport);
  Log.verbose(F("Bflipped = %t"),Bflipped);
  Log.verbose(F("Bindoor = %t"),Bindoor);
  Log.verbose(F("Display = %d"),display_what);
  Log.verbose(F("Brightness = %d"),display_brightness);
  if (pir_found)
    Log.verbose(F("Motion detector = %d"),pirInput);
  Log.verbose(F("AS3935 int pin = %d"),as3935_input);
  Log.verbose(F("AS3935 tune cap = %d"),as3935_tunecap);
  Log.verbose(F("nrofleds = %d"),nrofleds);
  Log.verbose(F("ledtype = %x"),ledtype);
  Log.verbose(F("CO2alert = %t"),Bco2alert);

}

void write_config () {
  StaticJsonDocument<512> doc;
  doc["myname"] = Smyname;
  JsonObject display = doc.createNestedObject("display");
  display["flipped"] = Bflipped;
  display["brightness"] = display_brightness;
  display["content"] =display_what;
  JsonObject network = doc.createNestedObject("network");
  network["pass"] = Spass;
  network["ssid"] = Sssid;
  JsonObject mqtt = doc.createNestedObject("mqtt");
  mqtt["server"] = Smqttserver;
  mqtt["user"] = Smqttuser;
  mqtt["pass"] = Smqttpass;
  mqtt["port"] = Imqttport;
  JsonObject location = doc.createNestedObject("location");
  location["site"] = Ssite;
  location["room"] = Sroom;
  location["indoor"] = Bindoor;

  JsonObject sensors = doc.createNestedObject("sensors");

  if (bme280_found) {
    JsonObject bme280 = sensors.createNestedObject("bme280");
    bme280["tempadjust"] = bme280TempAdjust;
  }

  if (bme680_found) {
    JsonObject bme680 = sensors.createNestedObject("bme680");
    bme680["tempadjust"] = bme680TempAdjust;
  }

  if (si7021_found) {
    JsonObject si7021 = sensors.createNestedObject("si7021");
    si7021["tempadjust"] = si7021TempAdjust;
  }

  if (pir_found) {
    JsonObject pir;
    pir = sensors.createNestedObject("pir");
    pir["pin"] = pirInput;
  }
  doc["as3935_input"] = as3935_input;
  doc["as3935_tunecap"] = as3935_tunecap;

  JsonObject leds;
  leds = doc.createNestedObject("led");
  leds["count"] = nrofleds;
  leds["type"] = ledtype;

  doc["co2alert"] = Bco2alert;


  Log.notice(F("Writing new config file"));
  serializeJsonPretty(doc,Serial);

  SPIFFS.begin();
  File f = SPIFFS.open("/config.json","w");
  if (!f) {
    Log.error(F("Open of config file for writing failed"));
  } else {
    if (serializeJson(doc,f)) {
      Log.notice(F("Written new config. Now reboot"));
    } else {
      Log.error(F("Writing object into file failed"));
    }
    f.close();
  }
SPIFFS.end();
}

// Logging helper routines
void printTimestamp(Print* _logOutput) {
  char c[12];
  sprintf(c, "%10lu ", millis());
  _logOutput->print(c);
}

void printNewline(Print* _logOutput) {
  _logOutput->print('\n');
}

// MQTT main callback routines
void mqtt_callback(char* topic, byte* payload, unsigned int length)  {

  String in[10];
  unsigned int wordcounter = 0;

  for (unsigned int i = 0; i < length; i++) {
    if ((char)payload[i] == ' ' && wordcounter < 9) {
      wordcounter++;
    } else {
      in[wordcounter] += String((char)payload[i]);
    }
  }
  Log.verbose("Message arrived[%s]: %d Words",topic,wordcounter);
  for (unsigned int i=0; i <= wordcounter; i++)
    Log.verbose("Word[%d] = %s",i,in[i].c_str());

  if (in[0] == "reboot") {
    ESP.restart();
  }

  if (in[0] == "status") {
    publish_status();
  }

  if (in[0] == "led") {
    if (wordcounter == 3) {
      // led r g b
      setled(in[1].toInt(),in[2].toInt(),in[3].toInt());
    } else if (wordcounter == 4) {
      setled(in[1].toInt(),in[2].toInt(),in[3].toInt(),in[4].toInt());
    }
  }

  if (in[0] == "leds") {
    // apply to all leds
    if (wordcounter == 3) {
      int i;
      for (i=0; i < nrofleds; i++)
        setled(i,in[1].toInt(),in[2].toInt(),in[3].toInt());
    }
  }

  if (in[0] == "camera") {
    publish_camera();
  }

  if (in[0] == "sensor") {
    // sensor name command
    if (wordcounter >= 1) {
      if (tcs_found && in[1] == "color") {
        if (wordcounter == 1) {
          loop_publish_tcs34725();
        }
        if (wordcounter == 2) {
          if (in[2] == "enable")
            color_watch = 1;
          if (in[2] == "disable")
            color_watch = 0;
        }
        if (wordcounter == 3) {
          if (in[2] == "gain") {
            tcs.setGain((tcs34725Gain_t) atoi(in[3].c_str()));
          }
          if (in[2] == "time") {
            tcs.setIntegrationTime((tcs34725IntegrationTime_t) atoi(in[3].c_str()));
            tcs.begin();
          }
          if (in[2] == "interrupt") {
            tcs.setInterrupt(in[3] == "on");

          }
        }
      }
      if (as3935_found && in[1] == "as3935") {
        if (wordcounter == 1) {
          publish_as3935();
        }
        if (wordcounter == 3) {
          if (in[2] == "tunecap") {
            as3935.tuneCap((uint8_t) atoi(in[3].c_str()));
            delay(50);
            as3935_tunecap = as3935.readTuneCap();
            Log.verbose(F("as3935 tuning capacitor now %d"),
              as3935_tunecap);
          }
        }
      }
      if (bme280_found && in[1] == "bme280") {
        if (wordcounter == 1) {
          publish_bme280();
        }
        if (wordcounter == 3 && in[2] == "tempadjust") {
          bme280.setTemperatureCompensation(atof(in[3].c_str()));
          bme280TempAdjust = bme280.getTemperatureCompensation();
          publish_bme280();
        }
      }

