wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
      if (bme680_found && in[1] == "bme680") {
        if (wordcounter == 1) {
          publish_bme680();
        }
        if (wordcounter == 3 && in[2] == "tempadjust") {
          bme680TempAdjust = atof(in[3].c_str());
          #if defined (BME680Bosch)
          iaqSensor.setTemperatureOffset(-1.0 * bme680TempAdjust);
          #endif
          publish_bme680();
        }
      }


      if (si7021_found && in[1] == "si7021") {
        if (wordcounter == 1) {
          publish_si7021();
        }
        if (wordcounter == 3 && in[2] == "tempadjust") {
          si7021TempAdjust = atof(in[3].c_str());
          publish_si7021();
        }
      }
    }
  }

  if (in[0] == F("config")) {
    if (wordcounter == 0) {
      log_config();
    }
    if (wordcounter == 1) {
      if (in[1] == F("write")) {
        log_config();
        write_config();
      }
    }
    if (wordcounter == 2) {
      if (in[1] == F("room")) {
        Sroom = in[2];
      }
      if (in[1] == F("site")) {
        Ssite = in[2];
      }
      if (in[1] == F("myname")) {
        Smyname = in[2];
      }
      if (in[1] == F("mqttuser")) {
        Smqttuser = in[2];
      }
      if (in[1] == F("mqttpass")) {
        Smqttpass = in[2];
      }
    }
  }

  if (u8x8_found && (in[0] == "display") && (wordcounter >= 1)) {
    last_display = 0;
    display_refresh = true;
    if (in[1] == "humidity") {
      display_what = DISPLAY_HUMIDITY;
    } else if (in[1] == "airpressure") {
      display_what = DISPLAY_AIRPRESSURE;
    } else if (in[1] == F("temperature")) {
      display_what = DISPLAY_TEMPERATURE;
    } else if (in[1] == F("distance")) {
      display_what = DISPLAY_DISTANCE;
    } else if (in[1] == F("temphum")) {
      display_what = DISPLAY_TEMPHUM;
    } else if (in[1] == F("co2")) {
      display_what = DISPLAY_CO2;
    } else if (in[1] == "off") {
      u8x8.clearDisplay();
      display_what = DISPLAY_OFF;
    } else if (in[1] == F("flip")) {
      u8x8.clearDisplay();
      u8x8.setFlipMode(wordcounter > 1);
      Bflipped = (wordcounter > 1);
    } else if (in[1] == F("brightness") && wordcounter >= 2) {
      display_brightness = in[2].toInt();
      Log.verbose(F("Setting brightness to %d"),display_brightness);
      u8x8.setContrast(display_brightness);
    } else { // String
      // large or small?
      // small, if a line is longer than 8 chars or if there are more than 3 lines
      boolean large = true;
      int start;
      for (unsigned int i=1; i<=wordcounter;i++) {
        if (in[i].length() > 8)
          large = false;
      }
      if (wordcounter > 3)
        large = false;

      if (wordcounter == 1)
        start = 3;
      else
        start = 0;

      display_what = DISPLAY_STRING;
      u8x8.setFont(u8x8_font_amstrad_cpc_extended_r);
      u8x8.clearDisplay();

      for (unsigned int i=1; i <= wordcounter; i++) {
        if (large) {
          u8x8.draw2x2UTF8(0, start, in[i].c_str());
          start += 3;
        } else {
          u8x8.draw1x2UTF8(0, start, in[i].c_str());
          start += 2;
        }
      }
    }
  }
}

boolean mqtt_reconnect() {
  // Loop until we're reconnected
  char mytopic[50];
  snprintf(mytopic, 50, "/%s/%s/status", Ssite.c_str(), Sroom.c_str());

  if (WiFi.status() != WL_CONNECTED) {
    if (!setup_wifi())
      return false;
  }

  Log.verbose("Attempting MQTT connection...%d...",client.state());

  // Attempt to connect
  if (client.connect(Smyname.c_str(),Smqttuser.c_str(),Smqttpass.c_str(),mytopic,0,0,"stopped")) {
    Log.verbose("MQTT connected");

    client.publish(mytopic, "started");
    delay(10);
    // ... and resubscribe to my name
    client.subscribe(Smyname.c_str());
    // and to my location
    String mylocation = "/" + Ssite + "/cmd";
    client.subscribe(mylocation.c_str());
    String myroom = "/" + Ssite + "/" + Sroom + "/cmd";
    client.subscribe(myroom.c_str());
    delay(10);
  } else {
    Log.error("MQTT connect failed, rc=%d",client.state());
  }
  return client.connected();
}

unsigned long lastReconnectAttempt = 0;
void mqtt_publish(char *topic, char *msg) {
  if (!client.connected()) {
    long now = millis();
    if (now - lastReconnectAttempt > 5000) {
      lastReconnectAttempt = now;
      if (mqtt_reconnect()) {
        lastReconnectAttempt = 0;
      }
    }
  }
  client.loop();


  char mytopic[50];
  snprintf(mytopic, 50, "/%s/%s/%s", Ssite.c_str(), Sroom.c_str(),topic);
  Log.verbose("MQTT Publish message [%s]:%s",mytopic,msg);

  client.publish(mytopic, msg);
}

void mqtt_publish(char *topic, uint8_t *buf, size_t len) {
  char mytopic[50];
  snprintf(mytopic, 50, "/%s/%s/%s", Ssite.c_str(), Sroom.c_str(),topic);

  client.publish(mytopic,buf,len);
}

void mqtt_publish(const __FlashStringHelper *topic, const __FlashStringHelper *msg) {
  char a[64],b[64];
  snprintf(a,63,"%s",topic);
  snprintf(b,63,"%s",msg);
  mqtt_publish(a,b);
}

void mqtt_publish(const __FlashStringHelper *topic, char *msg) {
  char a[64];
  snprintf(a,63,"%s",topic);
  mqtt_publish(a,msg);
}

void mqtt_publish(const __FlashStringHelper *topic, const char *msg) {
  char buf[64];
  snprintf(buf,63,"%s",msg);
  mqtt_publish(topic, buf);
}


void mqtt_publish(char *topic, int i) {
  char buf[15];
  snprintf(buf,14,"%d",i);
  mqtt_publish(topic, buf);
}

void mqtt_publish(char *topic, uint32_t i) {
  char buf[32];
  snprintf(buf,31,"%lu",i);
  mqtt_publish(topic,buf);
}

void mqtt_publish(const __FlashStringHelper *topic, uint32_t i) {
  char buf[32];
  snprintf(buf,31,"%lu",i);
  mqtt_publish(topic,buf);
}

void mqtt_publish(char *topic, float value) {
  char buf[15];
  snprintf(buf,14,"%.3f",value);
  mqtt_publish(topic, buf);
}

void mqtt_publish(const __FlashStringHelper *topic, float value) {
  char buf[15];
  snprintf(buf,14,"%.3f",value);
  mqtt_publish(topic, buf);
}



void mqtt_influx(char *field, char *value) {
  char out[128];

  sprintf(out,"sensor,site=%s,room=%s %s=%s",
    Ssite.c_str(), Sroom.c_str(),field,value);
  mqtt_publish("influx",out);
}

void mqtt_influx(char *field, int i) {
  char buf[15];
  snprintf(buf,14,"%di",i);
  mqtt_influx(field,buf);
}

