wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
void mqtt_influx(char *field, float f) {
  char buf[15];
  snprintf(buf,14,"%.3f",f);
  mqtt_influx(field,buf);
}

void mqtt_influx(char *field, uint32_t i) {
  char buf[32];
  snprintf(buf,31,"%lu",i);
  mqtt_influx(field,buf);
}

void mqtt_influx(char *field, bool b) {
  if (b)
    mqtt_influx(field,"true");
  else
    mqtt_influx(field,"false");
}

void mqtt_influx(const __FlashStringHelper *topic, const __FlashStringHelper *msg) {
  char a[32],b[32];
  snprintf(a,31,"%s",topic);
  snprintf(b,31,"%s",msg);
  mqtt_influx(a,b);
}

void mqtt_influx(const __FlashStringHelper *topic, char *msg) {
  char a[32];
  snprintf(a,31,"%s",topic);
  mqtt_influx(a,msg);
}

void mqtt_influx(const __FlashStringHelper *topic, const char *msg) {
  char buf[32];
  snprintf(buf,31,"%s",msg);
  mqtt_influx(topic, buf);
}

void mqtt_influx(const __FlashStringHelper *topic, uint32_t i) {
  char buf[32];
  snprintf(buf,31,"%lu",i);
  mqtt_influx(topic,buf);
}

void mqtt_influx(const __FlashStringHelper *topic, float f) {
  char buf[32];
  snprintf(buf,31,"%.3f",f);
  mqtt_influx(topic,buf);
}


// Setup routines
//
// Scan for sensors
//
void setup_i2c() {
  byte error, address;

// 0x03 AS3935 Lightning Detector
// 0x29 TSL45315 (Light)
// 0x29  Color
// 0x38 VEML6070 (Light)
// 0x39 TSL2561
// 0x3c Display
// 0x40 SI7021
// 0x48 4*AD converter ADS1115
// 0x4a GY49 or MAX44009 Light Sensor
// 0x50 PCF8583P
// 0x57 ATMEL732
// 0x5a CCS811 Gas Sensor
// 0x68 DS3231 Clock
// 0x76 BME280
// 0x77 BME680 (also BMP180)


  Log.notice("Scanning i2c bus");
  Wire.begin(I2CSDA, I2CSCL);
  Wire.setClock(10000);

  // Try for DISPLAY
#if defined(BOARD_HELTEC)
  pinMode(16,OUTPUT);
  digitalWrite(16,LOW);
  delay(100);
  digitalWrite(16,HIGH);
#endif

  for(address = 1; address < 127; address++ ) {
    Log.verbose(F("Trying %d"),address);
    Wire.beginTransmission(address);
    error = Wire.endTransmission();

    // force ok for Lightning sensor
    if (address == AS3935_ADDR && error != 0 && as3935_inconfig) {
      // force as3935 found
      Log.trace("AS3935 forced");
      error = 0;
    }

    if (error == 0) {
      Log.trace("I2C device found at address 0x%x",address);

      if (address == AS3935_ADDR) {
        as3935_found = as3935.begin();
        Log.notice(F("AS3935 found? %T"),as3935_found);
        if (as3935_found) {
          // initialize it
          // Are we indoor or outdoor?
          if (Bindoor) {
            as3935.setIndoorOutdoor(INDOOR);
          } else {
            as3935.setIndoorOutdoor(OUTDOOR);
          }
          // set default values (tune code later)
          as3935.maskDisturber(false);
          as3935.setNoiseLevel(1);
          as3935.watchdogThreshold(1);
          as3935.spikeRejection(2);
          as3935.lightningThreshold(5);
          as3935.tuneCap(as3935_tunecap);
          as3935.clearStatistics(true);
        }
      }

      if (address == 0x29) {
        tcs_found = tcs.begin();
        Log.notice(F("TCS found? %T"),tcs_found);

        if (!tcs_found) {
          lox_found = lox.begin();
          Log.notice(F("LOX found? %T"),lox_found);
        }
      }

      if (address == 0x39) {
        tsl2561 = Adafruit_TSL2561_Unified(address);
        tsl2561_found = tsl2561.begin();
        Log.notice("TSL2561 found? %T",tsl2561_found);
        if (tsl2561_found) {
          // init the sensor
          tsl2561.enableAutoRange(true);
          // tsl2561.setGain(TSL2561_GAIN_1X);
          tsl2561.setIntegrationTime(TSL2561_INTEGRATIONTIME_101MS);
        }
      }

      if (address == 0x38) {
        // VEML6070
        veml.begin(VEML6070_1_T);
        if (veml.readUV() != -1) {
          veml_found = true;
        }
        Log.notice(F("VEML6070 found? %T"), veml_found);
      }

      if (address == 0x3c) {
        u8x8_found = u8x8.begin();
        Log.notice("U8xu found? %T",u8x8_found);
        if (u8x8_found) {
          u8x8.clear();
          u8x8.setFont(u8x8_font_chroma48medium8_r);
          u8x8.setFlipMode(Bflipped);
        }
      }
      if (address == 0x40) {
        // SI7021
        si7021 = Adafruit_Si7021();
        si7021_found = si7021.begin();
        Log.notice("Si7021 found? %T",si7021_found);
      }

      if (address == 0x4a) {
        // GY-49
        float l = gy49.getLux();
        if (! gy49.getError()) {
          gy49_found = true;
          Log.notice(F("GY49 found at 0x%x"),address);
        }
      }

      if ((address >= 0x48) && (address <= 0x4b)) {
        ads1115 = Adafruit_ADS1115(address);
        ads1115.begin();
        ads1115_found = true;
        Log.notice(F("ADS1115 found at 0x%x"),address);
      }

      if (address == 0x5a) {
        // CCS811 Gas Sensor
        if (ccs.begin()){
          ccs811_found = true;
          Log.notice(F("CCS811 found at 0x%x"),address);
          // driver mode 60 seconds is enough
          if (Bco2alert)
            ccs.setDriveMode(CCS811_DRIVE_MODE_1SEC);
          else
            ccs.setDriveMode(CCS811_DRIVE_MODE_60SEC);
        }
      }
      if (address == 0x76 || address == 0x77) {
        // BME280 or BME680
        #if defined(BME680Bosch)
        iaqSensor.begin(address,Wire);
        checkIaqSensorStatus();
        if (bme680_found) {
          Log.notice("BME680 found using Bosch? %T at 0x%x",bme680_found,address);
          bsec_virtual_sensor_t sensorList[12] = {
            BSEC_OUTPUT_IAQ,
            BSEC_OUTPUT_CO2_EQUIVALENT,
            BSEC_OUTPUT_STABILIZATION_STATUS,
            BSEC_OUTPUT_RUN_IN_STATUS,
            BSEC_OUTPUT_RAW_TEMPERATURE,
            BSEC_OUTPUT_RAW_PRESSURE,
            BSEC_OUTPUT_RAW_HUMIDITY,
            BSEC_OUTPUT_RAW_GAS,
            BSEC_OUTPUT_COMPENSATED_GAS,
            BSEC_OUTPUT_GAS_PERCENTAGE,
            BSEC_OUTPUT_SENSOR_HEAT_COMPENSATED_TEMPERATURE,
            BSEC_OUTPUT_SENSOR_HEAT_COMPENSATED_HUMIDITY
          };
          iaqSensor.updateSubscription(sensorList, 12, BSEC_SAMPLE_RATE_LP);
          iaqSensor.setTemperatureOffset(-1.0 * bme680TempAdjust);
        #else // Adafruit
        bme680_found = bme680.begin(address);
        if (bme680_found) {
          bme680.setTemperatureOversampling(BME680_OS_8X);
          bme680.setHumidityOversampling(BME680_OS_2X);
          bme680.setPressureOversampling(BME680_OS_4X);
          bme680.setIIRFilterSize(BME680_FILTER_SIZE_3);
          bme680.setGasHeater(320, 150); // 320*C for 150 ms
          Log.notice("BME680 found using Adafruit? %T at 0x%x",bme680_found,address);
        #endif
        } else {
          bme280_found = bme280.begin(address);
          Log.notice("BME280 found? %T at 0x%x",bme280_found,address);
          bme280.setTemperatureCompensation(bme280TempAdjust);
          Log.notice("BME280 adjustment %F",bme280TempAdjust);
        }
      }
    }
  }
  Log.notice("End scanning i2c bus");
}

void setup_serial() {
  delay(1000);
  Serial.begin(115200);
}

void setup_logging() {
  Log.begin(LOG_LEVEL_VERBOSE, &Serial);
  Log.setPrefix(printTimestamp);
  Log.setSuffix(printNewline);
  Log.verbose("Logging has started");
}

// we assume there is always a LED connected
void setup_led() {
  led.begin();
  led.show();
  has_white = (ledtype >> 6) != ((ledtype >> 4) & 0x03);
}

// setup PIR motion detector
void setup_pir() {
  pinMode(pirInput, INPUT);
  pirState = digitalRead(pirInput);
}

// setup camera (if any)
void setup_camera() {
#if defined(ESP32_CAMERA)
  camera_config_t config;

  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sscb_sda = SIOD_GPIO_NUM;
  config.pin_sscb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;
  //init with high specs to pre-allocate larger buffers
  if (psramFound()) {
      Log.verbose(F("psram found"));
      config.frame_size = FRAMESIZE_UXGA;
      config.jpeg_quality = 10;
      config.fb_count = 2;
  } else {
      config.frame_size = FRAMESIZE_SVGA;
      config.jpeg_quality = 12;
      config.fb_count = 1;
  };

#if defined(BOARD_TTGO)
  pinMode(13, INPUT_PULLUP);
  pinMode(14, INPUT_PULLUP);
#endif
  esp_err_t err = esp_camera_init(&config);

  if (err == ESP_OK) {
    camera_found = true;
  } else {
    Log.error(F("esp32 camera error 0x%x"),err);
    return;
  }


#endif
}

// read the config file and parse its data
void setup_readconfig() {
  SPIFFS.begin();
  File f = SPIFFS.open("/config.json","r");
  if (!f) {
    Log.error("Cannot open config file");
    return;
  }
  StaticJsonDocument<1024> jsonBuffer;

 // Parse the root object
 // JsonObject root = jsonBuffer.parseObject(f);

 auto error = deserializeJson(jsonBuffer,f);
 if (error) {
   Log.error(F("Failed to read file %s"),error.c_str());
 } else {
   serializeJsonPretty(jsonBuffer,Serial);
 }

