wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
void callback_esp32_gap(esp_bt_gap_cb_event_t event, esp_bt_gap_cb_param_t *param) {
  char bda_str[18];
  char uuid_str[37];

  switch (event) {
    case 1:
      break;
    case ESP_BT_GAP_DISC_RES_EVT:
      sprintf(bda_str,"%02x:%02x:%02x:%02x:%02x:%02x",
        param->disc_res.bda[0],
        param->disc_res.bda[1],
        param->disc_res.bda[2],
        param->disc_res.bda[3],
        param->disc_res.bda[4],
        param->disc_res.bda[5]);
      Log.notice(F("BT Device found %s"),bda_str);
      update_device_info(param);

      break;
    default:
      Log.verbose(F("BT event %d"),event);
      break;
  }
}



void setup_esp32_bluetooth() {
  if (!btStart()) {
    Log.error(F("Failed to initialize bluetooth"));
    return;
  }

  if (esp_bluedroid_init() != ESP_OK) {
    Log.error(F("Failed to initialize bluedroid"));
    return;
  }

  if (esp_bluedroid_enable() != ESP_OK) {
    Log.error(F("Failed to enable bluedroid"));
    return;
  }

  esp_bt_dev_set_device_name(Smyname.c_str());
  esp_bt_gap_register_callback(callback_esp32_gap);
}

void setup_esp32() {
  setup_esp32_bluetooth();
}
#endif

void setup() {
  setup_led();
  setled(255,0,0);
  delay(5000);
  setup_serial();
  setup_logging();
  setup_readconfig();
  log_config();
  pinMode(as3935_input, INPUT);
  setup_i2c();
  if (pir_found)
    setup_pir();
#ifdef ARDUINO_ARCH_ESP32
  setup_esp32();
#endif
  setled(255, 128, 0);
  if (setup_wifi()) {
    setup_mqtt();
    setled(0, 255, 0);
    delay(1000);
    setled(0,0,0);
  } else {
    setled(2,1,0);
  }
  setup_camera();
  publish_status();
  if (as3935_found)
    pinMode(as3935_input, INPUT);
}

void publish_as3935() {
  String value;
  const __FlashStringHelper *s = F("status/sensors/as3935");
  if (as3935.readMaskDisturber()) {
    mqtt_publish(s,F("disturbers masked"));
  } else {
    mqtt_publish(s,F("disturbers NOT masked"));
  }
  if (as3935.readIndoorOutdoor() == INDOOR) {
    mqtt_publish(s,F("INDOOR"));
  } else {
    mqtt_publish(s,F("OUTDOOR"));
  }
  char buf[32];

  snprintf(buf,31,"%s %d",F("Watchdog Threshold"),
      (int)(as3935.readWatchdogThreshold()));
  mqtt_publish(s,buf);

  snprintf(buf,31,"%s %d",F("Noise Level"),
      (int)(as3935.readNoiseLevel()));
  mqtt_publish(s,buf);

  snprintf(buf,31,"%s %d",F("Spike Rejection"),
      (int)(as3935.readSpikeRejection()));
  mqtt_publish(s,buf);

  snprintf(buf,31,"%s %d",F("Lightning numbers threshold"),
      (int)(as3935.readLightningThreshold()));
  mqtt_publish(s,buf);

  snprintf(buf,31,"%s %d",F("Tuning capacitor"),
      (int)(as3935.readTuneCap()));
  mqtt_publish(s,buf);


}

void publish_status() {
  const __FlashStringHelper *status = F("status/sensors"),
   *net = F("status/network");
  String ipv4, ipv6, linkLocal;


  if (si7021_found) mqtt_publish(status,F("si7021_found"));
  if (bme280_found) mqtt_publish(status,F("bme280_found"));
  if (bme680_found) mqtt_publish(status,F("bme680_found"));
  if (tsl2561_found) mqtt_publish(status,F("tsl2561_found"));
  if (voltage_found) mqtt_publish(status,F("voltage_found"));
  if (u8x8_found) mqtt_publish(status,F("u8x8_found"));
  if (veml_found) mqtt_publish(status,F("veml_found"));
  if (lox_found) mqtt_publish(status,F("lox_found"));
  if (tcs_found) mqtt_publish(status,F("tcs_found"));
  if (ads1115_found) mqtt_publish(status,F("ads1115_found"));
  if (ccs811_found) mqtt_publish(status,F("ccs811_found"));
  if (pir_found) mqtt_publish(status,F("pir_found"));
  if (camera_found) mqtt_publish(status,F("camera_found"));
  if (as3935_found) {
    mqtt_publish(status, F("as3935_found"));
    publish_as3935();
  }
#if defined(ARDUINO_ARCH_ESP8266)
  mqtt_publish(F("status/ChipID"),(uint32_t)ESP.getChipId());
  mqtt_publish(F("status/ResetReason"),ESP.getResetReason().c_str());
  mqtt_publish(F("status/SdkVersion"),ESP.getSdkVersion());
  mqtt_publish(F("status/SketchSize"),ESP.getSketchSize());
  mqtt_publish(F("status/CycleCount"),ESP.getCycleCount());
#endif
  mqtt_publish(F("status/CompileTime"), compile_date);

#if LWIP_IPV6 && defined(ARDUINO_ARCH_ESP8266)
for (auto a : addrList) {
  a.isV6() ? a.isLocal() ? linkLocal = a.toString() : ipv6 = a.toString() : ipv4 = a.toString();

  Log.verbose(F("IF=%s index=%d legacy=%d IPv4=%d local=%d hostname='%s' addr= %s"),
                a.ifname().c_str(),
                a.ifnumber(),
                a.isLegacy(),
                a.addr().isV4(),
                a.addr().isLocal(),
                a.ifhostname(),
                a.addr().toString().c_str());


}

mqtt_publish(F("status/ipv4"), ipv4.c_str());
mqtt_publish(F("status/ipv6ll"), linkLocal.c_str());
mqtt_publish(F("status/ipv6"), ipv6.c_str());
#else
  mqtt_publish(F("status/ipv6"),F("disabled"));
#endif
}

void loop_publish_voltage(){
#if defined(ARDUINO_ARCH_ESP8266)
  mqtt_publish("voltage", (float)(ESP.getVcc() / 1000.0));
  mqtt_influx("voltage", (float)(ESP.getVcc() / 1000.0));
#endif
}

void loop_publish_tsl2561() {
  if (tsl2561_found) {
    sensors_event_t event;

    if (tsl2561.begin()) {
      uint16_t br, ir;
      tsl2561.getLuminosity(&br, &ir);
      uint32_t lux = tsl2561.calculateLux(br, ir);
      mqtt_publish("light",lux);
      mqtt_influx("light",lux);
    } else {
      Log.verbose("loop_publish_tsl2561: Sensor not initialized");
    }
  }
}

void publish_bme280() {
  if (bme280_found) {
    mqtt_publish(F("bme280/tempadjust"),
      (float)bme280.getTemperatureCompensation());
  }
}

void publish_bme680() {
  if (bme680_found) {
    mqtt_publish(F("bme680/tempadjust"),
      (float)bme680TempAdjust);
  }
}

void publish_si7021() {
  if (si7021_found) {
    mqtt_publish(F("si7021/tempadjust"),
      (float)si7021TempAdjust);
  }
}

void loop_publish_bme280() {
  if (bme280_found) {
    mqtt_publish("temperature", bme280.readTemperature());
    mqtt_publish("airpressure", bme280.readPressure() / 100.0F);
    mqtt_publish("humidity", bme280.readHumidity());
    mqtt_influx("temperature", bme280.readTemperature());
    mqtt_influx("airpressure", bme280.readPressure() / 100.0F);
    mqtt_influx("humidity", bme280.readHumidity());
  }
}

