wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
#if defined(BME680Bosch)
void checkIaqSensorStatus(void) {
  bme680_found = true;
  if (iaqSensor.status != BSEC_OK) {
    if (iaqSensor.status < BSEC_OK) {
      Log.error(F("BSEC error code %d"), iaqSensor.status);
      bme680_found = false;
    } else {
      Log.warning(F("BSEC warning code %d"), iaqSensor.status);
    }
  }

  if (iaqSensor.status != BME680_OK) {
    if (iaqSensor.status < BME680_OK) {
      Log.error(F("BME680 error code %d"), iaqSensor.bme680Status);
      bme680_found = false;
    } else {
      Log.warning(F("BME680 warning code %d"), iaqSensor.bme680Status);
    }
  }

}

void loop_publish_bme680() {
  if (bme680_found) {
    if (iaqSensor.run()) {
      mqtt_publish(F("temperature"), (float)iaqSensor.temperature);
      mqtt_influx(F("temperature"), (float)iaqSensor.temperature);
      mqtt_publish(F("humidity"), (float)iaqSensor.humidity);
      mqtt_influx(F("humidity"), (float)iaqSensor.humidity);
      mqtt_publish(F("airpressure"), iaqSensor.pressure / 100.0F);
      mqtt_influx(F("airpressure"), iaqSensor.pressure / 100.0F);
      mqtt_influx(F("gasResistance"),(float)iaqSensor.gasResistance);
      mqtt_influx(F("compGasValue"),(float)iaqSensor.compGasValue);
      if (iaqSensor.runInStatus == 1 &&
          iaqSensor.stabStatus == 1) {
        mqtt_publish(F("CO2"), iaqSensor.co2Equivalent);
        mqtt_influx(F("CO2"), iaqSensor.co2Equivalent);
        mqtt_publish(F("airquality"), iaqSensor.iaq);
        mqtt_influx(F("airquality"), iaqSensor.iaq);
        mqtt_influx(F("gasPercentage"),iaqSensor.gasPercentage);
        Log.verbose(F("  co2Ac=%d iaqAc=%d compGasAccuracy=%d gasPercentageAcccuracy=%d"),
          iaqSensor.co2Accuracy,iaqSensor.iaqAccuracy,
          iaqSensor.compGasAccuracy,
          iaqSensor.gasPercentageAcccuracy);
      }  else {
        Log.notice(F("bme60 runIn = %F stab = %F"),
                  iaqSensor.runInStatus,
                  iaqSensor.stabStatus);
        Log.verbose(F("  gasResistance=%F compGasValue=%F gasPercentage=%F compGasAccuracy=%d gasPercentageAcccuracy=%d"),
          iaqSensor.gasResistance,
          iaqSensor.compGasValue,
          iaqSensor.gasPercentage,
          iaqSensor.compGasAccuracy,
          iaqSensor.gasPercentageAcccuracy);
        Log.verbose(F("  rawtemp=%F rawHum=%F"),
          iaqSensor.rawTemperature,
          iaqSensor.rawHumidity
        );
        Log.verbose(F("  temp=%F hum=%F press=%F co2=%F iaq=%F"),
          iaqSensor.temperature,
          iaqSensor.humidity,
          iaqSensor.pressure / 100.0F,
          iaqSensor.co2Equivalent,
          iaqSensor.iaq);
        Log.verbose(F("  co2Ac=%d iaqAc=%d"),
          iaqSensor.co2Accuracy,iaqSensor.iaqAccuracy
        );
      }
    } else {
      checkIaqSensorStatus();
    }
  }


}
#else // Adafruit
void loop_publish_bme680() {
  if (bme680_found && bme680.performReading()) {
    mqtt_publish("temperature", (float) (bme680.temperature + bme680TempAdjust));
    mqtt_publish("airpressure", bme680.pressure / 100.0F);
    mqtt_publish("humidity", (float)bme680.humidity);
    mqtt_publish("airquality", bme680.gas_resistance / 1000.0F);

    mqtt_influx("temperature", (float)bme680.temperature);
    mqtt_influx("airpressure", bme680.pressure / 100.0F);
    mqtt_influx("humidity", (float)bme680.humidity);
    mqtt_influx("airquality", bme680.gas_resistance / 1000.0F);

  }
}
#endif


void loop_publish_veml6070() {
  if (veml_found) {
    mqtt_publish("UV", veml.readUV());
    mqtt_influx("UV", veml.readUV());
  }
}

void loop_publish_gy49() {
  if (gy49_found) {
    mqtt_publish(F("light"),(float)gy49.getLux());
    mqtt_influx(F("light"),(float)gy49.getLux());
  }
}

int co2ampel(int co2value) {
  if (Bco2alert) {
    if (co2value <=1000) {
      setled(0,255,0);
    } else if (co2value <= 2000) {
      setled(255,255,0);
    } else {
      setled(255,0,0);
    }

  }
  return co2value;
}

void loop_publish_ccs811() {
  if (ccs811_found) {
    if (ccs.available()) {
      if (!ccs.readData()) {
        mqtt_publish("CO2", co2ampel(ccs.geteCO2()));
        mqtt_publish("TVOC", ccs.getTVOC());
        mqtt_influx("CO2",co2ampel(ccs.geteCO2()));
        mqtt_influx("TVOC",ccs.getTVOC());
      } else {
        Log.verbose(F("Error reading data from CCS811"));
      }
    } else {
      Log.verbose(F("No data available at CCS811"));
    }
  }
}


void loop_publish_si7021() {
  if (si7021_found) {
    mqtt_publish("temperature", si7021.readTemperature() + si7021TempAdjust);
    mqtt_publish("humidity", si7021.readHumidity());
    mqtt_influx("temperature", si7021.readTemperature() + si7021TempAdjust);
    mqtt_influx("humidity", si7021.readHumidity());
  }
}

void loop_publish_tcs34725() {
  if (tcs_found) {
    uint16_t r,g,b,c;
    tcs.getRawData(&r,&g,&b,&c);

    Log.verbose(F("TCS Color raw: R=%d G=%d B=%d C=%d"),r,g,b,c);
    uint16_t minval = min(min(r,g),b);
    uint16_t maxval = max(max(r,g),b);

    int d1 = abs(r-g);
    int d2 = abs(r-b);
    int d3 = abs(g-b);

    int maxdist = max(max(d1,d2),d3);
    int mindist = min(min(d1,d2),d3);

    if (maxdist > 40) {
      r = map(r,minval,maxval,0,255);
      g = map(g,minval,maxval,0,255);
      b = map(b,minval,maxval,0,255);
    }

    setled(r,g,b);
    Log.verbose(F("TCS Color adj: R=%d G=%d B=%d C=%d"),r,g,b,c);
  }
}

static unsigned long lastReportTime = 0;
static bool lastReportState = false;

void loop_publish_motion(bool m) {
  // report motion (true or false)
  // remember when last report was and report only once a minute


//  if (lastReportTime + 60l*1000l > millis())
//    return;

  lastReportTime = millis();
  lastReportState = m;
  mqtt_influx("motion", m);
  mqtt_publish("motion", (int) m);
}

int loop_get_lox_distance() {
  if (lox_found) {
    VL53L0X_RangingMeasurementData_t measure;
    lox.rangingTest(&measure);
    if (measure.RangeStatus != 4) {
      // mqtt_influx(F("distance"), measure.RangeMilliMeter);
      return measure.RangeMilliMeter;
    }
  }
  return -1;
}

