wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
void lights_on(int dist) {
  bool x = false;

  if (dist == 1406)
    return;

 if ((dist > 0) && (dist < 500))
    x = true;

  if (x == light_on)
    return;

  Log.verbose(F("Lights on? %T %d mm"),x,dist);

  light_on = x;

  if (x) {
    led.setPixelColor(0, led_current_color);
    led.show();
    loop_publish_motion(true);
  } else {
    led_current_color = led.getPixelColor(0);
    led.clear();
    led.show();
    loop_publish_motion(false);
  }

  if (u8x8_found) {
    if (x) {
      u8x8.setContrast(255);
    } else {
      u8x8.setContrast(display_brightness);
    }
  }
}

// read PIR if it exists
void loop_pir() {
  if (pir_found) {
    int pir_old = pirState;
    pirState = digitalRead(pirInput);
    // Low -> Low
    if (pir_old == LOW && pirState == LOW)
      return;
    // Low -> High
    if (pir_old == LOW && pirState == HIGH) {
      loop_publish_motion(true);
    }

    // High -> High
    if (pir_old == HIGH && pirState == HIGH)
      return;
    // High -> Low
    if (pir_old == HIGH && pirState == LOW) {
      loop_publish_motion(false);
    }
  }
}

static int noiseCount=0;
static int totalDisturberCount=0;
static int loopcount = 0;
void loop_as3935() {
  byte watchDogVal = as3935.readWatchdogThreshold();
  if (digitalRead(as3935_input) == HIGH) {
    lightningStatus intReason = (lightningStatus) as3935.readInterruptReg();
    if (intReason == NOISE_TO_HIGH) {
      Log.verbose(F("as3935: noise %d"),++noiseCount);
      byte noiseFloor = as3935.readNoiseLevel();
      if (noiseCount > 2 && noiseFloor < 7) {
        as3935.setNoiseLevel(++noiseFloor);
        Log.verbose(F("as3935: noiseFloor %d"),noiseFloor);
      }
    }
    if (intReason == DISTURBER_DETECT) {
      Log.verbose(F("as3935: disturber %d"),++totalDisturberCount);
      if (totalDisturberCount > 2) {
        if (watchDogVal < 10) {
          as3935.watchdogThreshold(++watchDogVal);
          Log.verbose(F("as3935: watchDogVal %d"),watchDogVal);
        } else {
          as3935.maskDisturber(true);
          Log.verbose(F("as3935: Disturbers masked"));
        }
      }
    }
    if (intReason == LIGHTNING) {
      byte distance = as3935.distanceToStorm();
      uint32_t energy = as3935.lightningEnergy();
      Log.notice(F("as3935: Lightning detected in %d km, energy %u"),distance,energy);
      mqtt_publish(F("lightning/distance"), (uint32_t)distance);
      mqtt_publish(F("lightning/energy"), energy);
      mqtt_influx(F("lightning/distance"), (uint32_t)distance);
      mqtt_influx(F("lightning/energy"), energy);

    }
  }
  if (++loopcount > 10000) {
    loopcount = 0;
    if (totalDisturberCount > 2 && watchDogVal > 2) {
      --totalDisturberCount;
      --watchDogVal;
      as3935.maskDisturber(false);
      as3935.watchdogThreshold(watchDogVal);
      Log.verbose(F("as3935: WatchDogVal %d"),watchDogVal);
    }
  }
}

#define BOUNDARY     "--------------------------133747188241686651551404"
String body(String content , String message)
{
  String data;
  data = "--";
  data += BOUNDARY;
  data += F("\r\n");
  if(content=="imageFile")
  {
    data += F("Content-Disposition: form-data; name=\"imageFile\"; filename=\"picture.jpg\"\r\n");
    data += F("Content-Type: image/jpeg\r\n");
    data += F("\r\n");
  }
  else
  {
    data += "Content-Disposition: form-data; name=\"" + content +"\"\r\n";
    data += "\r\n";
    data += message;
    data += "\r\n";
  }
   return(data);

}

String header(String token,size_t length)
{
  String  data;
      data =  F("POST /receive/upload.php HTTP/1.1\r\n");
      data += F("cache-control: no-cache\r\n");
      data += F("Content-Type: multipart/form-data; boundary=");
      data += BOUNDARY;
      data += "\r\n";
      data += F("User-Agent: PostmanRuntime/6.4.1\r\n");
      data += F("Accept: */*\r\n");
      data += F("Host: ");
      data += F("lancre.garf.de");
      data += F("\r\n");
      data += F("accept-encoding: gzip, deflate\r\n");
      data += F("Connection: keep-alive\r\n");
      data += F("content-length: ");
      data += String(length);
      data += "\r\n";
      data += "\r\n";
    return(data);
}


String sendImage(String token,String message, uint8_t *data_pic,size_t size_pic)
{
  String bodyTxt =  body("uploadBtn",message);
  String bodyPic =  body("imageFile",message);
  String bodyEnd =  String("--")+BOUNDARY+String("--\r\n");
  size_t allLen = bodyTxt.length()+bodyPic.length()+size_pic+bodyEnd.length();
  String headerTxt =  header(token,allLen);
  WiFiClient http;

  if (!http.connect("lancre.garf.de",80))
  {
    return("connection failed");
  }

   http.print(headerTxt+bodyTxt+bodyPic);
   http.write(data_pic,size_pic);
   http.print("\r\n"+bodyEnd);

   delay(20);
   long tOut = millis() + 100000;
   while(http.connected() && tOut > millis())
   {
    if (http.available())
    {
      String serverRes = http.readStringUntil('\r');
        return(serverRes);
    }
   }
}


void publish_camera() {
#if defined(ESP32_CAMERA)
  sensor_t *s = esp_camera_sensor_get();
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;

  Log.verbose(F("camera framesize: %u"),s->status.framesize);
  fb = esp_camera_fb_get();
  if (!fb) {
    Log.error(F("camera capture failed"));
    return;
  } else {
    Log.verbose(F("camera format %d"), fb->format);
    Log.verbose(F("camera buf size %d"), fb->len);
  }

  Log.verbose(F("sending Image"));
  Log.verbose(F("sent Image: %s"),sendImage("x1","Upload",fb->buf,fb->len).c_str());


  esp_camera_fb_return(fb);
#endif
}

void loop() {
  // put your main code here, to run repeatedly:
  client.loop();

  if (!client.connected()) {
    now = millis();
    if (now - lastReconnectAttempt > 5000) {
      lastReconnectAttempt = now;
      if (mqtt_reconnect()) {
        lastReconnectAttempt = 0;
      }
    }
  }
  client.loop();

#if defined(ARDUINO_ARCH_ESP32)
  esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, 10, 10);
#endif

  if (as3935_found) {
    loop_as3935();
  }

  // read sensors and publish values
  if (color_watch)
    loop_publish_tcs34725();
  client.loop();

  if ((millis() - last_transmission) > (transmission_delay * 1000)) {
  // Voltage
    loop_publish_voltage();
    client.loop();
    loop_publish_tsl2561();
    client.loop();
    loop_publish_bme280();
    client.loop();
    loop_publish_bme680();
    client.loop();
    loop_publish_veml6070();
    client.loop();
    loop_publish_gy49();
    client.loop();
    loop_publish_si7021();
    client.loop();
    loop_publish_ccs811();
    client.loop();
    last_transmission = millis();
  }
  client.loop();
  if (pir_found)
    loop_pir();
  client.loop();

  if (lox_found) {
    int distance = loop_get_lox_distance();
    lights_on(distance);
  }
  client.loop();

  if (u8x8_found &&
      light_on &&
      (((millis() - last_display) > (1000*30)) ||
       (display_what == DISPLAY_DISTANCE) ||
       display_refresh
     )
    ) {
    char s[10];
    u8x8.setFont(u8x8_font_amstrad_cpc_extended_r);
    display_refresh = false;
    client.loop();
    switch(display_what) {
      case DISPLAY_TEMPHUM:
        if (bme280_found) {
          char h[10];
          snprintf(s, 9, "%.1f C", bme280.readTemperature());
          snprintf(h, 9, "%.1f %%", bme280.readHumidity());
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 1, s);
          u8x8.draw2x2String(1, 4, h);
        }
        break;
      case DISPLAY_TEMPERATURE:
        if (bme280_found) {
          snprintf(s, 9, "%.1f C", bme280.readTemperature());
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
      case DISPLAY_HUMIDITY:
        if (bme280_found) {
          snprintf(s, 9, "%.1f %%", bme280.readHumidity());
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
      case DISPLAY_AIRPRESSURE:
        if (bme280_found) {
          snprintf(s, 9, "%d hPa", (int)(bme280.readPressure() / 100));
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
      case DISPLAY_CO2:
          if (ccs811_found && ccs.available()) {
            snprintf(s, 9, "%dppm", ccs.geteCO2());
            u8x8.clearDisplay();
            u8x8.draw2x2String(1, 3, s);
          }
          break;
      case DISPLAY_DISTANCE:
        if (lox_found) {
          int dist = loop_get_lox_distance();
          if (dist >= 0) {
            snprintf(s,9,"%d mm",dist);
          } else {
            snprintf(s,9,"---- mm");
          }
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
    }
    u8x8.setContrast(display_brightness);
    last_display = millis();
  }
  client.loop();

}
